# CouplerMark Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerMark Property
ParameterTypeId Class See Also
---
"Schedule Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace